
Feature: Въвеждане на родители
 
  Scenario Outline: Въвеждане на родител
  	Given Админът отваря приложението за добавяне на родители
  	When Въвежда "<Име>" на родител
  	And Въвежда телефонен номер "<Номер>"
  	And Натиска бутона за въвеждане 
    Then Вижда съобщение: "<Съобщение>"

    Examples: 
      | Име   | Номер      | Съобщение  |
      | Gosho | 0883335553 | Успешно Въведени данни |
      | Gosho | 08765421	 | Въведете номер с повече символи	    |
      | Go    | 0876542155 | Въведете име с повече символи	    |
      |       | 08765421	 | Въведете име с повече символи    |
      | Gosho |         	 | Въведете номер с повече символи	    |
