Feature: Вход в приложението на детската градина
  
  Background:
    Given Потребителя отваря екрана за вход в системата
  
  Scenario: Вход в системата с валидни данни    
    When Въвежда "Gosho" родителско име
    And Натиска бутона за въвеждане 
    Then Вижда съобщение: "Влязохте успешно!"
    
    Scenario: Вход в системата без данни
    When Натиска бутона за въвеждане 
    Then Вижда съобщение: "Въведете име на родител!"
    
    Scenario: Вход в системата с грешни данни
    When Въвежда "gre6no Ime" родителско име
    And Натиска бутона за въвеждане 
    Then Вижда съобщение: "Сгрешени данни!"
    
       
