Feature: Въвеждане данни за дете 

	Background:
      Given Родителя отваря екрана за управление на данните 

  Scenario: Успешно въвеждане данни за дете
    When Добавя име: "Petar"
    And Добавя данни за Работещи родители
    And Добавя данни за Дете с увреждане
    And Добавя данни за Дете с близнак 
    And Добавя данни за Брат/сестра
    And Натиска бутона за въвеждане
    Then Вижда съобщение: "Успешно въведени данни"
    
    
    Scenario: Въвеждане данни без Име
    And Добавя данни за Работещи родители
    And Добавя данни за Дете с увреждане
    And Добавя данни за Дете с близнак 
    And Добавя данни за Брат/сестра
    And Натиска бутона за въвеждане
    Then Вижда съобщение: "Въведете име на дете!"
    
    Scenario: Въвеждане данни с прикалено късо име
    When Добавя име: "Nm"
    And Добавя данни за Работещи родители
    And Добавя данни за Дете с увреждане
    And Добавя данни за Дете с близнак 
    And Добавя данни за Брат/сестра
    And Натиска бутона за въвеждане
    Then Вижда съобщение: "Въведете име с повече символи"
    
    Scenario: Въвеждане данни без Работещи родители
    When Добавя име: "Petar"
    And Добавя данни за Дете с увреждане
    And Добавя данни за Дете с близнак 
    And Добавя данни за Брат/сестра
    And Натиска бутона за въвеждане
    Then Вижда съобщение: "Въведете всички данни"
    
    Scenario: Въвеждане данни без Дете с близнак
    When Добавя име: "Petar"
    And Добавя данни за Работещи родители
    And Добавя данни за Дете с увреждане
    And Добавя данни за Брат/сестра
    And Натиска бутона за въвеждане
    Then Вижда съобщение: "Въведете всички данни"
    
    Scenario: Въвеждане данни без Дете с увреждане
    When Добавя име: "Petar"
    And Добавя данни за Работещи родители
    And Добавя данни за Дете с близнак 
    And Добавя данни за Брат/сестра
    And Натиска бутона за въвеждане
    Then Вижда съобщение: "Въведете всички данни"
    
    Scenario: Въвеждане данни без Брат/сестра
    When Добавя име: "Petar"
    And Добавя данни за Работещи родители
    And Добавя данни за Дете с увреждане
    And Добавя данни за Дете с близнак 
    And Натиска бутона за въвеждане
    Then Вижда съобщение: "Въведете всички данни"
